   -- Демонстрация вычисления значения функции y=cos(x)
   -- с помощью разложения функции в ряд Тейлора в ок-
   -- рестности точки x=0
   --
   --             2    4    6              2k
   --            x    x    x           k  x
   --  cos(x)=1- -- + -- - -- +...+(-1)  ----- +...
   --            2!   4!   6!            (2k)!
   --
   -- *********************************************
   -- Результат вычисления значения функции cos(x);
   -- k - количество слагаемых ряда Тейлора
   ----------------------------------------
   cos' x k = sum (abc x k)
   -- ****************************************
   -- Функция, возвращающая список, содержащий
   -- k слагаемых ряда Тейлора
   -----------------------------------
   abc:: Double -> Integer -> [Double]
   abc x k = [a x n | n <- [0..k]]
   -- *****************************************
   -- Функция, возвращающая значение n-го члена
   -- ряда Тейлора в точке x
   -------------------------------
   a:: Double -> Integer -> Double
   a x n | n==0 = 1
         | True = -x*x/((2*y-1)*2*y)*(a x (n-1))
       where y = fromInteger n 
   -- ******************************************
   -- Функция, возвращающая "остаток" от деления
   -- вещественных чисел a и b 
   ----------------------------------
   perev:: Double -> Double -> Double
   perev a b = a-b*fromInt (truncate (a/b))
   -- *************************************
   -- Функция, реализующая тестирование
   --------------------------------------------
   test :: Double -> Integer ->(Double, Double) 
   test x k = (cos' (perev x (2*pi)) k, cos x)
   -------------------------------------------
