   /* Демонстрация:                                 */
   /*  (1) операций, нестрогих по второму аргументу */
   /*      (отложенных вычислений);                 */
   /*  (2) энергичных вычислений                    */
   /* --------------------------------------------- */
   #include<stdio.h>
   #include<conio.h>
      int bot();
      int const_1 (int);
   /* --------------- */
   int main()
   {
      int x=0, y=1;
      /* ----------------------------- */
      /* Простые отложенные вычисления */
      /* ----------------------------- */
      printf("(1) %d\n",y||5/x);
      getch();
      printf("(2) %d\n",0&&5/x);
      getch();
      printf("(3) %d\n",x<y?y: 1 / 0);
      getch();
      /* ---------------------------------- */
      /*  "Странные" отложенные вычисления  */
      /* ---------------------------------- */
      x=1 / 0; y=2; printf("(4) %d %d\n",x,y);
      getch();
      /* ------------------------------------------- */
      /*          "Энергичные" вычисления            */
      /* ------------------------------------------- */
      printf("Вошли в функцию bot() и \"висим\"...\n");
      const_1 (bot());
      return 0;
   }
   /* --- */
   int bot()
   /* Функция реализует бесконечную рекурсию */
   {
      return bot();
   }
   /* ------------- */
   int const_1 (int n)
   /* Функция возвращает 1 независимо */
   /* от значения аргумента           */
   {
      return 1;
   }
