   -- Демонстрация функции, возвращающей потенциально
   -- бесконечный список степеней числа n
   -- (первый способ)
   -----------------------------
   step51:: Integer -> [Integer]
   step51 k = map (k^) [1..]

   -- ***********************************************
   -- Демонстрация функции, возвращающей потенциально
   -- бесконечный список степеней числа 5
   -- (второй способ)
   --------------------------
   step52 k = map step2 [1..]
      where step2 n | n==0 = 1
                    | True = stepQuick k n 
            stepQuick n m | m==0         = 1
                          | m `rem` 2==0 = stepQuick (n*n) 
                                                     (m `div` 2)
                          | True         = n*stepQuick (n*n) 
                                                    ((m-1) `div` 2)
   -- *************************************************************
   -- Неудачные тестовые примеры:
   -------------------------------------------------
   test = take 750 (step51 5) == take 750 (step52 5)
