  -- Лабораторная работа №5
  -- Простая рекурсия на списках
  -- Вариант 9(1)
  -- Гончаренко Шамиль ИСИТ (2 подгруппа)
  -------------------------------------------------------


  --------------------- Раздел 1 ------------------------


  -- Задание(4). Напишите функцию, определяющую наибольшее из всевозможных
  --             попарных проиведений элементов числового списка.


	f1 lst = maximum (a lst)
		where a [x] = [x]
		      a (x:xs)   = (b x xs) ++ (a xs)
		      b x []     = []
		      b x (y:ys) = (x*y) : b x ys
     

  -------------- Test ---------------
	f1Test = f1 [1,2,5,3,10,4]
  -----------------------------------
               

  --------------------- Раздел 2 ------------------------


  -- Задание(1). Напишите функцию, возвращающую элемент по номеру его расположения в списке.


	f2 1 (x:xs) = x
	f2 n (x:xs) = f2 (n-1) (xs)  
		
     

  -------------- Test ---------------
	f2Test = f2 3 [1,2,5,3,10,4]
  -----------------------------------

  -------------------------------------------------------

  -- Задание(4). Напишите программу, запрашивающую число (не более 100 знаков)
  --             и печатующую слово "Плавное", если число плавное, и "Нет" в противном случае.


	f3 n | n `div` 10 == 0 = "Plavnoe"
             | True = (f3'.lst') n
		where lst' n = lst'' n []
			where lst'' 0 lst = lst
                              lst'' n lst | length lst > 100 = undefined
                                        | True = lst'' (n`div`10) ((n`mod` 10):lst)
                      f3' [x] = "Plavnoe"
                      f3' (x:xs) | abs(x-head xs) /= 1 = "Ne plavnoe"
                                 | True = f3' xs
	  


		
     

  -------------- Test ---------------
	f3Test1 = f3 12345
	f3Test2 = f3 134510
	f3Test3 = f3 654323456
  -----------------------------------


  --------------------- Раздел 3 ------------------------



  -- Задание(3). Напишите функцию, осуществляющую перестановку местами соседних элементов списка.

	f4 [] = []
	f4 [x] = [x]
	f4 (x:y:xs) = y:x:f4 xs


  -------------- Test ---------------
	f4Test = f4 [1..10] 
  -----------------------------------
 

  -------------------------------------------------------

  -- Задание(4). Напишите функцию, которая по двум заданным спискам выводит
  --             единный список, элементы которого образованы путем сложения
  --             элементов исходных списков, стоящих на одинаковых позициях.

	f5 [] [] = []
	f5 [] [y] = y:[]
	f5 [x] [] = x:[]
	f5 (x:xs) [] = x:[] ++ f5 (xs) []
	f5 [] (y:ys) = y:[] ++ f5 [] (ys)
	f5 [x] [y] = x+y:[] 
	f5 (x:xs) (y:ys) = x+y:[] ++ f5 (xs) (ys)


  -------------- Test ---------------
	f5Test1 = f5 [1..10] [1..10]
	f5Test2 = f5 [1..10] [1..5] 
	f5Test3 = f5 [2,4..10] [1..10]
  -----------------------------------

  --------------------------------------------------------

  -- Задание(6). Напишите функцию, обращающую каждый элемент списочной структуры
  --             (т.е списки), а также саму списочную структуру.

                                                 
	f6 [] = []
	f6 [x] = x:[] 
        f6 (x:xs) = f6 xs ++ x:[] 


  -------------- Test ---------------
	f6Test1 = f6 [1..10]
  -----------------------------------

  -------------------------------------------------

  -- Задание(7). Напишите функцию, удаляющую из списка повторные вхождения элементов.


	f7 [] = []
	f7 [x] = [x]
        f7 (x:xs) | elem x xs = x:f7 (del x xs)
	          | True = x:f7 xs
		where   del n [] = [] 
			del n lst | n == head lst = del n (tail lst)
                                  | True = head lst:del n (tail lst)     


  -------------- Test ---------------
	f7Test1 = f7 [1,5,2,3,4,5,5,5,5,6,7,10]
	f7Test2 = f7 [5,123,1,2,3,3,3,1]
	f7Test3 = f7 [1,2,1,2,1,2,3,1,2,1,2,3,1,2,3]
  -----------------------------------




