-- ТЕМА 1

-- Задание 1(3)
-- Функция возвращает последний элемент непустого списка
-- Задание 2
   f1::[Int]->Int
   f1 lst = abs (head lst - (head.reverse)lst)
---------------------------------------
-- ТЕМА 2

-- Задание 1
   f2::[Int]->[Int]
   f2 lst = (tail.init) lst
-- Задание 6
   f3 lst = if  (head lst) < (head.tail) lst 
              then (head lst) : lst
            else lst
--------------------------------------            
-- ТЕМА 3

-- Задание 1
   f4::[Int]->[Int]->[Int]
   f4 lst ls = (take ((length lst) `div` 2) lst )++( drop ((length ls) `div` 2) ls)
-- Задание 6
   f5::[Int]->[Int]->[Int]
   f5 lst ls = filter (<0) lst ++ filter (>0) ls
-------------------------------------  	
-- ТЕМА 4

-- Задание 5
-- [1,2,3,4,5]
-- [[1],[2],[3],[]]
-- [[5,1],[2,3],[]]
-- [[1],[[2]],[[[3]]]]
-- Задание 7
--[]
--[]:[]
--((1:[]):((2:[]):(3:[]):(4:[])))
--((1:(2:[]):(3:(4:[]))))
--((1:[]):(2:(22:[]):(3:(33:(333:[])))))
--(((9:(8:(7:(6:[])))):[]):((5:(4:(3:[]))):[]):((2:(1:[])):[]):((0:[]):[]))
---------------------------------------
-- Тестовые примеры:

   test  = f1 [11,4,9,5] == 6
   test' = f1 [0,6,4,3]  == 3
   test''= f1 [-5,4,1,9] == 14
   test1 = f1 [-5,6,9,-3]== 2
   test2 = f2 [1,6,9,4]  == [6,9]
   test3 = f3 [1,6,7,6]  == [1,1,6,7,6]
   test4 = f3 [8,4,3,9,1]== [8,4,3,9,1]
   test5 = f4 [5,6,2] [8,9,2,4] == [5,2,4]
   test6 = f5 [-3,-5,0] [6,-3]  == [-3,-5,6]
   test7 = f5 [8,0,4] [-3,0,5]  == [0,5]
   test8 = f5 [8,5,3,1] [-6,-9] == []