


--Напишите функцию, которая получает на вход пару элементов, 
--а возвращает пару, в которой второй элемент равен сумме двух элементов исходной пары  
z :: (Integral a, Floating b) => [(a,b)] -> [(a,b)]
z = map (\(k,a) -> (k, a + fromIntegral k))

--22
f [] _ = []
f (x:xs) k = (take k (repeat x)) : f xs k
-------------------------------------------
test1 | f [1,2,3] 3 == [[1,1,1],[2,2,2],[3,3,3]] = True
test2 | f [6,7,8] 2 == [[6,6],[7,7],[8,8]] = True 

--24
f' n k lst = drop n (take k lst)
----------------------------------
test3 | f' 0 2 [1,2,3,5] == [1,2] = True
test4 | f' 1 4 [1,2,4,5,6] == [2,4,5] = True

