   -- Демонстрация сравнения эффективности по памяти 
   -- двух функций, реализованных с помощью свёртки
   -- *********************************************
   -- Реализация функции reverse для списка [1..n]
   -- с помощью свёртки foldr
   ----------------------------------------
   reverseR = foldr (\x xs -> xs ++ [x]) []

   -- ********************************************
   -- Реализация функции reverse для списка [1..n]
   -- с помощью свёртки foldl
   --------------------------------------
   reverseL  = foldl (\ys x -> x : ys) []
   reverseL' = foldl (flip (:)) []

   -- ********************************************
   -- Реализация функции reverse для списка [1..n]
   -- с помощью свёртки foldl' 
   ---------------------------------
   reverseL'' = foldl' (flip (:)) []
       where foldl'           :: (a -> b -> a) -> a -> [b] -> a
             foldl' f a []     = a
             foldl' f a (x:xs) = (foldl' f $! f a x) xs

   -- ***************************
   -- Неудачные тестовые примеры:
   ------------------------------
   test1 = reverseR  [1..531]
   ----------------------------
   test2 = reverseL  [1..10000] 
   test3 = reverseL' [1..10000]
   -----------------------------
   test4 = reverseL'' [1..10000]
