   -- Демонстрация параллельной рекурсии на примере
   -- вычисления значения функции вида:
   --  
   --  f(0)=13, f(1)=17, f(2)=20, f(3)=30,
   --
   --  f(2n)=43*f(n)+57*f(n+1),
   --
   --  f(2n+1)=91*f(n)+179*f(n+1), n>=2
   ------------------------------------
   fD:: Integer -> Integer
   fD n | n==0   = 13
        | n==1   = 17
        | n==2   = 20
        | n==3   = 30 
        | even n = 43*fD (n `div` 2)   + 57*fD ((n `div` 2)+1) 
        | True   = 91*fD((n-1) `div` 2)+179*fD(((n-1) `div` 2)+1)
   --------------------------------------------------------------
   res:: Int -> [Integer]
   res k = take k (map (fD) [0..])

   -- ***************************
   -- Неудачные тестовые примеры:
   ------------------------------
   test = res 100
   