   -- Демонстрация формальных преобразований функций на языке
   -- Haskell  с  использованием комбинаторного исчисления на
   -- примере вычисления значения арифметического выражения
   --
   --   x-(y+z)
   -- *****************************
   -- Функция fun1 до трансформации
   --------------------------------
   fun1:: Int -> Int -> Int -> Int
   fun1 x y z = (-) x ((+) y z)
   ---------------------------------------------
   -- Демонстрация по шагам этапов трансформации
   -- с помощью комбинаторов:
   --
   --   Babc=a(bc), Cabc=acb
   ------------------------------------------------
   -- Mx(Pyz) = (Mx)((Py)z)     = B(Mx)(Py)z      =
   --         = (B(Mx))(Py)z    = (BBMx)(Py)z     =
   --         = (BBM)x(Py)z     = C(BBM)(Py)xz    =
   --         = (C(BBM)(Py))xz  = (B(C(BBM))P)yxz =
   --         = C(B(C(BBM))P)xyz
   ---------------------------------------------
   -- Демонстрация по шагам этапов трансформации
   -- с помощью языка Haskell:
   --   (1) flip - это аналог комбинатора C;
   --   (2) (.)  - это аналог комбинатора B
   ----------------------------------------
   z1 = (-) 3 ((+) 4 5)
   z2 = ((-) 3) (((+) 4) 5)
   z3 = (.) ((-) 3) ((+) 4) 5
   z4 = ((.) ((-) 3)) ((+) 4) 5
   z5 = ((.) (.) (-) 3) ((+) 4) 5
   z6 = flip ((.) (.) (-)) ((+) 4) 3 5
   z7 = (flip ((.) (.) (-)) ((+) 4)) 3 5
   z8 = (.) (flip ((.) (.) (-))) (+) 4 3 5
   z9 = flip ((.) (flip ((.) (.) (-))) (+)) 3 4 5
   -- *******************************************
   -- Функция fun1 после трансформации
   -----------------------------------
   fun2:: Int -> Int -> Int -> Int 
   fun2 x y z = flip ((.) (flip ((.) (.) (-))) (+)) x y z
   ------------------------------------------------------
   -- Функция fun1 (в виде комбинатора)
   ------------------------------------ 
   fun21:: Int -> Int -> Int -> Int 
   fun21 = flip ((.) (flip ((.) (.) (-))) (+))
   -- ******************************************************
   -- Демонстрация аналогичной по структуре функции, выделя-
   -- ющей подслово слова z, длина которого x, начинающегося
   -- с позиции с номером y
   --------------------------------------------------------
   fun3 x y z = flip ((.) (flip ((.) (.) take)) drop) x y z
   -- *****************************************************
   -- Неудачные тестовые примеры:
   ------------------------------
   test1 = fun1  3 4 5 == (-6)
   test2 = fun2  3 4 5 == (-6)
   test3 = fun21 3 4 5 == (-6)
   ------------------------------
   test4 = fun3  3 2 "0123456789"
   test5 = fun3  5 0 "0123456789"
   test6 = fun3 15 5 "0123456789"
