   -- Определите, какие задачи решаются с помощью при-
   -- ведённых ниже функций.
   -- Указание. Рассмотрите арифметическое выражение
   --           (a+b)*b
   -- ********************************
   -- Моделирование комбинаторов W и S
   -----------------------------------
   s a b c = a c (b c)
   -------------------
   w a b   = a b b
   -- **************
   -- Прочие функции
   -------------------------------
   tst1 = (.) w ((.) ((.)(*)) (+))
   ---------------------------------------
   tst2 x = (.) ((.)((.) w) flip) ((.)(.)) 
                   (\x -> \y -> x*y) (\x -> x+1) x
              == s (\x -> \y -> x*y) (\x -> x+1) x
   ---------------------------------------------------------------
   tst3 = w (flip ((.) (.) ((.) (==) (\x -> x+1))) (\x -> x+1)) 23
