   -- Демонстрация конструирования функций, пригодных  для
   -- организации частичных вычислений, на примере функции
   --
   --  [x,y]++z=(x:y:[])++z
   --
   -- с помощью преобразования в бесточечное представление
   --
   -- C(B(B(C(B(B(++))(:))))(:))
   -- **************************************
   u:: [Int] -> Int -> Int -> [Int] -> [Int]
   u = flip((.)((.)(flip((.)((.)(++))(:))))(:))
   -------------------------------------------------------
   -- Частичная функция, построенная с помощью функции u()
   -------------------------------------------------------
   u1:: Int -> Int -> [Int] -> [Int]
   u1 = flip((.)((.)(flip((.)((.)(++))(:))))(:)) []
   -------------------------------------------------------
   -- Частичная функция, построенная с помощью функции u()
   -------------------------------------------------------
   u2:: Int -> [Int] -> [Int]
   u2 = flip((.)((.)(flip((.)((.)(++))(:))))(:)) [] 2
   -- ***********************************************
   -- Неудачные тестовые примеры:
   ------------------------------
   test1 = u [] 2 1 [3,4,5]
   test2 = u1   2 1 [3,4,5] 
   test3 = u2     1 [3,4,5]
 