   -- Демонстрация трансформации комбинаторов
   -- **********************************************
   -- Моделирование списка, содержащего один элемент
   -------------------------------------------------
   list1 = flip (:) []

   -- **********************************************
   -- Моделирование списка, содержащего два элемента
   -------------------------------------------------
   list2 = (.) (flip (:)) (flip (:) [])

   -- **********************************************
   -- Моделирование списка, содержащего два элемента
   -------------------------------------------------
   list2' = flip ((.) (flip (:)) (flip (:) []))
