{- Экзамен 
   1 осенний семестр 2016-2017 уч. год, ИС, первый курс
  -}

{- 26. Удалите n-ый элемент из списка, вернув его и список.
  -} 
  f:: Int -> [a] -> (a,[a])
  f n lst = (lst!!n, f' lst 0 [])
      where f' [] i res = res
            f' (x:xs) i res | i==n = f' xs (i+1) res                                           
                            | True = f' xs (i+1) (res++[x])            
  --  Неудачные тестовые примеры:
  test = f 1 "abcd"   == ('b',"acd") &&
         f 2 "123456" == ('3',"12456") &&
         f 4 "123456" == ('5',"12346")
  
