{- Экзамен 
   1 осенний семестр 2016-2017 уч. год, ИС, первый курс
  -}

{- 24. Выделите подсписок с n-го по k-ый номер [n;k).
  -}                                              
  f:: [a] -> Int -> Int -> [a]
  f lst n k = f' lst n k 0 []
      where f' [] n k i res = res
            f' (x:xs) n k i res | (i>=n) && (i<k) = 
                                  f' xs n k (i+1) (res++[x])
                                | True = f' xs n k (i+1) res  
  
  --  Неудачные тестовые примеры:
  test = f "abcdefghik" 2 5 == "cde" &&
         f "123456789" 2 5  == "345" &&
         f "123456789" 1 5  == "2345"  
 
