   -- Демонстрация решения задачи "Покер"
   -- ***************************************
   res lst | elem 5 lst                   = 1
           | elem 4 lst                   = 2
           | elem 2 lst && elem 3 lst     = 3
           | elem 1 lst && elem 3 lst     = 4
           | elem 1 lst && (col 2 lst==2) = 5 
           | elem 2 lst && (col 1 lst==3) = 6
           | True                         = 7
   ------------------------------------------
   col x lst | null lst    = 0
             | head lst==x = 1 + col x (tail lst)
             | True        = col x (tail lst)
   ------------------------------------------
   povt lst1 lst2 | null lst1 = []
                  | True      = (col (head lst1) lst2) : 
                                      povt (tail lst1) lst2
   -- *****************************************************
   -- Неудачные тестовые примеры:
   --------------------------------
   test1 =   col 4 [5,7,2,1,4,4]==2
          && col 4 [5,7,2,1]    ==0
   --------------------------------
   test2 = povt [1..5] [1,1,1,3,4]
   test3 = povt [1..5] [1,2,3,4,5]
   test4 = povt [1..5] [5,4,4,2,1]
   ------------------------------------------
   test5 = res (povt [1..5] [2,2,3,3,4]) == 5
   test6 = res (povt [1..5] [2,2,2,1,5])
   test7 = res (povt [1..5] [2,2,2,1,1]) == 3
   test8 = res (povt [1..5] [1,1,2,3,4]) == 6
