   {- Демонстрация использования кортежей для воз- -}
   {- вращения нескольких значений.                -}
   {- Назначение функций определите самостоятельно -}
   {- -------------------------------------------- -}
   f:: Integer -> (Integer,Integer)
   f x = ((x `div` 10) `mod` 10, x `mod` 10)
   -----------------------------------------
   maxMin:: (Int,Int) -> (Int,Int)
   maxMin (x,y) = if x>=y
                    then (x,y)
                    else (y,x)
   ------------------------------
   -- Неудачные тестовые примеры:
   ------------------------------
   test1 = f 234        == (3,4)
   test2 = maxMin (1,2) == (2,1)
