   -- Демонстрация использования функционала filter
   -- *********************************************
   -- Функция возвращает количество отрицательных
   -- элементов в числовом списке lst
   ----------------------------------
   func:: [Int] -> Int
   func lst = length $ filter (0 >) lst

   -- ************************
   -- Функция возвращает сумму
   --
   --  E(1)+E(2)+...+E(100),
   --
   -- где E(k) - сумма нечётных цифр натурального числа k
   ------------------------------------------------------
   res lst = sum $ map f lst
   ------------------------------------
   f n = sum $ map (\x -> digitToInt x)
                   (filter (\x -> digitToInt x `mod` 2 == 1)
                           (show n))

   -- ***************************
   -- Неудачные тестовые примеры:
   ---------------------------------------------
   test1 =   func []                      ==   0 
          && func [5]                     ==   0
          && func [1,-2,3,-4]             ==   2
          && func [1,-2,-3,-4]            ==   3
          && func (map (* (-1)) [1..100]) == 100
   ---------------------------------------------
   test2 = res [1..   10] ==     26
   test3 = res [1..  100] ==    501
   test4 = res [1..10000] == 100001
