   -- Демонстрация использования функционала takeWhile
   -- *************************************************
   -- Функция возвращает индекс элемента числового спи-
   -- ска, значение которого равно сумме первого  и по-
   -- следнего элементов этого списка
   ----------------------------------
   asd:: [Int] -> Int  
   asd lst | null lst            = error "Результат не определён"
           | vsp lst==length lst = error "Элемент отсутствует"
           | True                = 1 + vsp lst
      where vsp lst = length $ takeWhile (/= (head lst + last lst))
                                         lst

   -- ***************************
   -- Неудачные тестовые примеры:
   --------------------------------------
   test1 =   asd [1,2,3,4,2]         == 3
          && asd [2,5,7,2,3,1]       == 5
          && asd [0,5,7,3,1,4,3,7,8] == 9
   --------------------------------------
   test2 = asd [1,-1,2,-3,3,4]
   test3 = asd [1,2,3,-2,3]
  