   -- Демонстрация функционалов curry и uncurry.
   ---------------------------------------------
   -- Отметим, что:
   --  (1) f a b - это каррированная форма представления
   -- функции f(a,b);
   --  (2) f (a,b) - это некаррированная форма представ-
   -- ления функции f a b
   -- **********************************************
   -- Демонстрация каррированной функции "умножение"
   -- (вызов функции аналогичен принятому в функцио-
   --  нальном программировании)
   ----------------------------- 
   abc:: Int -> Int -> Int
   abc a b = (*) a b
   -- *************************************************
   -- Демонстрация некаррированной функции  "умножение"
   -- (вызов функции аналогичен принятому в математике)
   ---------------------------------------------------- 
   abc':: (Int,Int) -> Int
   abc' (a,b) = (*) a b

   -- ****************************************************
   -- Функция позволяет преобразовать некаррированную фор-
   -- му f (a,b) в каррированную форму curry' f a b
   ------------------------------------------------
   curry':: ((t,u) -> v) -> (t -> u -> v)
   curry' f a b = f (a,b)
   -- **************************************************
   -- Функция позволяет преобразовать каррированную фор-
   -- му f a b в некаррированную форму uncurry' f (a,b)
   ----------------------------------------------------
   uncurry':: (t -> u -> v) -> ((t,u) -> v)
   uncurry' f (a,b) = f a b

   -- *********************************
   -- Моделирование функционала uncurry
   ------------------------------------
   uncurry'' f p = f (fst p) (snd p)

   -- **************************************************
   -- Демонстрация удобного изменения порядка аргументов
   -- в каррированной функции
   -------------------------------------- 
   flip':: (t -> u -> v) -> (u -> t -> v)
   flip' f b a = f a b

   -- ***************************
   -- Неудачные тестовые примеры:
   --------------------------------------------
   test1 = abc   3 4  == 12 && abc' (3,4) == 12
   test2 = abc   4 5  == uncurry' abc (4,5)
   test3 = abc' (4,5) == curry' abc' 4 5
   test4 = uncurry'' (-) (2,5) == uncurry' (-) (2,5)
