   -- Демонстрация функций, возвращающих длину самой длинной по-
   -- следовательности повторяющихся символов в непустом слове
   -- ********************************************************
   import List
   -- ***********************************************
   -- (1) С использованием функционалов map, groupBy)
   --------------------------------------------------
   cba:: [Char] -> Int
   cba word = maximum $ map (\x -> length x)
                            (groupBy (==) word)
   -- **********************************************************
   -- (2) Двухпроходной алгоритм; без использования функционалов
   -------------------------------------------------------------
   longest word = maximum $ bca word 0 []
   --------------------------------------
   bca:: [Char] -> Int -> [Int] -> [Int]
   bca word k lst | null word = lst
                  | null (tail word)
                              = (k+1) : lst 
                  | head word==head (tail word)
                              = bca (tail word) (k+1)      lst
                  | True      = bca (tail word)   0   ((k+1) : lst)
   -- *************************************************************
   -- (3) Однопроходной алгоритм; без использования функционалов
   -------------------------------------------------------------
   bca':: [Char] -> Int -> Int -> Int
   bca' word k l | null word = l
                 | null (tail word)
                             = max (k+1) l
                 | head word==head (tail word)
                             = bca' (tail word) (k+1) l
                 | True      = bca' (tail word) 0 (max (k+1) l)
   -- *********************************************************
   -- Неудачные тестовые примеры:
   -----------------------------------
   test1 = bca "abbcccddddeeeccb" 0 []
   test2 = bca "abcdeeeeeeeecbde" 0 []
   test3 = \x -> ((==) (longest x) (cba x))
   test4 = \x -> bca' x 0 0
