   -- Демонстрация использования функционала map
   -- для высказывания предположения (не доказа-
   -- тельства!) о том, что формула для a(n)
   --
   --        n    n+1
   --  a(n)=3 -n*3
   --
   -- удовлетворяет рекурсивному определению
   --
   --  a(0)=1,                     
   --  a(1)=-6,                   
   --  a(k)=6*a(k-1)-9*a(k-2), k>1
   -------------------------------
   f1:: Integer -> Integer
   f1 n = 3^n - n*3^(n+1)
   -----------------------
   f2:: Integer -> Integer
   f2 n | n==0 = 1
        | n==1 = -6
        | True = 6 * f2(n-1) - 9 * f2(n-2)
   -- ************************************
   -- Неудачные тестовые примеры:
   ---------------------------------------
   test = map f1 [1..25] == map f2 [1..25]
