   -- Демонстрация вычисления значения функции y=sin(x)
   -- с помощью разложения функции в ряд Тейлора в ок-
   -- рестности точки x=0
   --
   --             3    5    7              2k+1
   --            x    x    x           k  x
   --  sin(x)=x- -- + -- - -- +...+(-1)  ------- +...
   --            3!   5!   7!            (2k+1)!
   --
   -- *********************************************
   -- Результат вычисления значения функции sin(x);
   -- k - количество слагаемых ряда Тейлора
   ----------------------------------------
   sin' x k = sum (abc x k)
   -- ****************************************
   -- Функция, возвращающая список, содержащий
   -- k слагаемых ряда Тейлора
   -----------------------------------
   abc:: Double -> Integer -> [Double]
   abc x k = [a x n | n <- [0..k]]
   -- *****************************************
   -- Функция, возвращающая значение n-го члена
   -- ряда Тейлора в точке x
   -------------------------------
   a:: Double -> Integer -> Double
   a x k | k==0 = x
         | True = -x*x/((2*y+1)*2*y)*(a x (k-1))
       where y = fromInteger k 
   -- ******************************************
   -- Функция, возвращающая "остаток" от деления
   -- вещественных чисел a и b 
   ----------------------------------
   perev:: Double -> Double -> Double
   perev a b = a-b*fromInt (truncate (a/b))
   -- *************************************
   -- Функция, реализующая тестирование
   --------------------------------------------
   test :: Double -> Integer -> (Double,Double) 
   test x k = (sin' (perev x (2*pi)) k, sin x)
