   -- Функция возвращает сумму квадратов n первых
   -- натуральных чисел; при вызове k=0
   ------------------------------------
   f0 n | n==0 = 0
        | True = n^2 + f0 (n-1)
   ----------------------------
   f1 n k | n==0 = k
          | True = f1 (n-1) (k+n*n)
   -----------------------------------
   f2 n = sum (map (\x -> x^2) [1..n])

   -- ******************
   -- Функция возвращает 
   --     1  2      n
   --  1+2 +2 +...+2
   ------------------
   g n | n==1 = 3
       | True = 2^n + g (n-1)

   -- ***************************
   -- Неудачные тестовые примеры:
   -------------------------------------------
   test0 n = f0 n   == n*(n+1)*(2*n+1) `div` 6
   test1 n = f1 n 0 == n*(n+1)*(2*n+1) `div` 6
   test2 n = f2 n   == n*(n+1)*(2*n+1) `div` 6
   test3 n = g  n   == 2*(2^n-1)
