   -- Демонстрация конструирования собственной операции
   -- "композиция функций" с указанием имени  операции,
   -- её ассоциативности и приоритета
   ----------------------------------
   infixr 9 >.>
   (>.>):: (Float -> Float) -> (Float -> Float) 
                            -> (Float -> Float)
   f >.> g = f . g
   ------------------------------------------------------------
   -- Демонстрация определения собственной операции "композиция
   -- функций" с помощью лямбда-функций (безымянных функций)
   ---------------------------------------------------------
   ($.$):: (Float -> Float) -> (Float -> Float)
                            -> (Float -> Float)
   f $.$ g = \x -> f (g x)

   -- ***************************
   -- Неудачные тестовые примеры:
   --------------------------------------------
   test1 = (asin >.> sin >.> acos >.> cos) 0.45
   test2 = (log >.> exp >.> exp >.> log)  0.45
   -------------------------------------------
   test3 = (sin $.$ asin) 0.45
   test4 = ((\x -> x+1) $.$ (\y -> y-1)) 23 
